#### BuiltInFailures.EditingFailures Members

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures EditingFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AllInvisibleInPlanViewWarn | None of the created elements are visible in [View Type] View. You may want to check the active view, its Parameters, and Visibility settings, as well as any Plan Regions and their settings. |
| Public property Static member | AllInvisibleInViewWarn | None of the created elements are visible in [View Type] View. You may want to check the active view, its Parameters, and Visibility settings. |
| Public property Static member | BorrowElementsAtRisk | Can't obtain permission to edit the element: The Central Model is inaccessible. You can check out worksets at risk, but consider carefully! |
| Public property Static member | CannotBorrowBusyContention | Can't obtain permission to edit the element. The Central Model is busy. |
| Public property Static member | CannotCheckoutWorksets | Can't make workset editable. User '[Borrowers]' has already checked it out. |
| Public property Static member | CannotDeleteEditedElement | Can't delete element that is being edited. |
| Public property Static member | CannotDeleteEditedElementError | Can't delete element that is being edited. |
| Public property Static member | CannotDeletePredefinedFamilyElement | Element is a built-in part of the family definition and cannot be deleted or added to groups. |
| Public property Static member | CannotDrawInCurrentView | Can't draw because Work Plane is at a very sharp angle in this view. Go to another view or redefine the Work Plane. |
| Public property Static member | CannotDuplicateType | Cannot Duplicate Type |
| Public property Static member | CannotEditDeletedElements | Can't edit the element. It was deleted in the Central Model. |
| Public property Static member | CannotEditDeletedWorkset | This action has caused deletion of non-editable Workset ' [Name] '. |
| Public property Static member | CannotEditEditingElements | Can't obtain permission to edit the element: The Central Model is inaccessible and another user is editing the element. |
| Public property Static member | CannotEditElements | Workset is editable, but you can't edit the element until '[Borrowers]' resaves the element to central and relinquishes it and you Reload Latest. |
| Public property Static member | CannotEditRenamedWorkset | Can't edit workset ' [Name] '. |
| Public property Static member | CannotMirrorInView | Must specify Work Plane to mirror in a 3d View. |
| Public property Static member | CannotMoveElement | Can't move element. |
| Public property Static member | CannotMoveElementWarn | Can't move element. |
| Public property Static member | CannotMoveElementWithoutWorkplane | Element(s) need a workplane to be moved in. There's no workplane defined in this view. |
| Public property Static member | CannotMoveHereInViewError | Can't move here at this view angle. Set another Work Plane or adjust the view. |
| Public property Static member | CannotMoveInView | Can't move element because the move plane is seen at a very sharp angle in this View |
| Public property Static member | CannotMoveInViewError | Can't move element because the move plane is seen at a very sharp angle in this View |
| Public property Static member | CannotMoveLocked | Can't move pinned element. |
| Public property Static member | CannotMoveTogether | Can't move these elements at the same time. One of them is restricted to moving in one direction while the other is restricted to moving in a conflicting direction. |
| Public property Static member | CannotPickHereInCurrentView | Can't pick here at this view angle. Set another Work Plane or adjust the view. |
| Public property Static member | CannotRotateLocked | Can't rotate pinned element. |
| Public property Static member | CannotScaleInView | Can't scale because Move Plane is at a very sharp angle in this view. Change view angle or go to another view. |
| Public property Static member | DeletedRequestedWarn | You have deleted elements that other users requested. |
| Public property Static member | DeleteElementsError | [Description] |
| Public property Static member | DeleteElementsWarn | [Description] |
| Public property Static member | DeletePreventedByGroup | Grouped elements can only be deleted when the group is being edited. To delete a member select the group and then click the Edit Group button on the toolbar, then delete the member. |
| Public property Static member | ElementNotEditable | One or more elements are not editable. |
| Public property Static member | ElementReversed | Element is reversed. |
| Public property Static member | ElementsDeleted | Elements were deleted. |
| Public property Static member | ElementsDeletedPastedToKeep | Elements were deleted. Use Edit Pasted Elements to keep them. |
| Public property Static member | ElementsNotInPlane | Elements don't lie on the same plane. |
| Public property Static member | ElementsWillBeDeleted | Elements in [Design Option] will be deleted |
| Public property Static member | ExtendToOtherCrash | Can't keep [Type Name] extended to [Type Name]. |
| Public property Static member | ExtendToOtherWarn | Can't keep [Type Name] extended to [Type Name]. |
| Public property Static member | GeneratedByMassing | Selected element(s) produced from Massing shape. Once deleted, the selected element(s) will not be regenerated |
| Public property Static member | HaveNoPermissionToEdit | You do not have permission to edit the element. |
| Public property Static member | HiddenBeamsEditingWarning | The beam join being modified contains beam that are not visible. Geometry of visible beams may be affected by hidden beams. |
| Public property Static member | InvalidArrayObject | Some or all of the selected objects can't be created in an Array (for example, a Camera object for a 3D View). |
| Public property Static member | InvalidElemsInSelection | Can't scale elements together. |
| Public property Static member | LockedDeleted | Pinned objects deleted. |
| Public property Static member | LockedDeletedWarn | Pinned objects deleted. |
| Public property Static member | MirrorProjectSuccess | [Action] command has successfully processed [Number] elements |
| Public property Static member | NElementsDeleted | [Number] elements were deleted |
| Public property Static member | NElementsWrongPosition | Review [Number] elements for correct position and shape |
| Public property Static member | NoRotateMirrorZ | Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground. |
| Public property Static member | NoRotateMirrorZError | Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground. |
| Public property Static member | OutOfDateElements | Workset is editable, but you must Reload Latest before editing the element. |
| Public property Static member | OwnedByOther | Can't edit the element until '[Partition Name]' resaves the element to central and relinquishes it and you Reload Latest. |
| Public property Static member | OwnElementsOutOfDate | You now own the element, but your file is out of date. You must Reload Latest before editing the element. |
| Public property Static member | PinnedObjectHostDeleted | Some pinned objects were deleted because their parent or host object was deleted. |
| Public property Static member | PinnedObjectNotDeleted | Pinned objects were not deleted. To delete them, unpin them before using delete. |
| Public property Static member | PinnedObjectSomeDeleted | Some pinned objects were deleted while others were not. |
| Public property Static member | PlacementFailed | Failed to place component. |
| Public property Static member | PressShowToSee | Press Show to see the element(s); then Ignore or Cancel |
| Public property Static member | ReloadBeforeMakeEditable | You must Reload Latest before editing the element. |
| Public property Static member | ReloadNoGood | You must Reload Latest before editing the element, but the Central Model is inaccessible or being accessed by another user. |
| Public property Static member | RPCTurnOffInRealisticWarn | None of the placed RPC elements are visible when the visual style is set to Realistic. To see the elements, change VisualStyle of the current view, or change RPC visibility in Graphic Display Options. |
| Public property Static member | SourceInEditMode | Can't transfer project standards while source document is in an edit mode. Please exit all edit modes(In-Place Family Edit Mode, Group Edit Mode, Sketch Edit Mode, etc.) and try again. |
| Public property Static member | TargetInEditMode | Can't transfer project standards while target document is in an edit mode. Please exit all edit modes(In-Place Family Edit Mode, Group Edit Mode, Sketch Edit Mode, etc.) and try again. |
| Public property Static member | TemporaryChangesOutOfDate | You must Reload Latest before editing the element. Changes will be temporary, and will not be saved. |
| Public property Static member | TemporaryChangesTransparentPermissions | Permission to edit the element cannot be obtained. Changes will be temporary, and will not be saved. |
| Public property Static member | TooManyElementsToCheckout | Too many elements were attempted to be marked as editable, prompt user to mark workset(s) editable instead |
| Public property Static member | UnableFilletSpecifiedRadius | Unable to create Fillet with the specified radius. |
| Public property Static member | UnableToMakeSourceWorksetEditable | Unable to make the necessary Workset ([Name]) editable in the Linked File in order to change the Shared Coordinates. |
| Public property Static member | UnableToTransformElement | Attempted an invalid element rotate, mirror, or move. |
| Public property Static member | UnableToTransformElementError | Attempted an invalid element rotate, mirror, or move. |
| Public property Static member | WorksetHasChangedInCentralFile | This workset has changed in the Central Model. Please Reload Latest before making this workset editable. |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace